Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: 1,000 rows
fr: 1 000 lignes
ko: 1,000개 행
tr: 1.000 satır
vi: 1.000 dòng
zh_hans: 1,000 行
zh_hant: 1,000 列

source: Average row length
fr: Longueur moyenne de la rangée
ko: 평균 행 길이
tr: Ortalama satır uzunluğu
vi: Độ dài dòng trung bình
zh_hans: 平均行长度
zh_hant: 平均列長度

source: Schema of %@
fr: Schéma de %@
ko: %@의 스키마
tr: %@ şeması
vi: Schema của %@
zh_hans: %@ 的 Schema
zh_hant: %@ 的綱要

source: No rows
fr: Pas de rangées
ko: 행 없음
tr: Satır yok
vi: Không có dòng
zh_hans: 无行
zh_hant: 沒有資料列

source: Column to filter on
fr: Colonne à filtrer sur
ko: 필터링할 열
tr: Filtrelenecek sütun
vi: Cột để lọc
zh_hans: 用于筛选的列
zh_hant: 用於篩選的欄位

source: Authentication Method
fr: Méthode d'authentification
ko: 인증 방식
tr: Kimlik doğrulama yöntemi
vi: Phương thức xác thực
zh_hans: 身份验证方式
zh_hant: 身分驗證方式

source: Mixed Selection
fr: Sélection mixte
ko: 혼합 선택
tr: Karışık Seçim
vi: Lựa chọn hỗn hợp
zh_hans: 混合选择
zh_hant: 混合選取

source: Opens database URLs from the terminal, such as a DDEV project database.
fr: Ouvre les URL de la base de données depuis le terminal, comme une base de données de projet DDEV.
ko: 터미널에서 DDEV 프로젝트 데이터베이스와 같은 데이터베이스 URL을 엽니다.
tr: Terminalden gelen veritabanı URL'lerini açar, örneğin bir DDEV proje veritabanı.
vi: Mở các URL cơ sở dữ liệu từ terminal, ví dụ cơ sở dữ liệu của dự án DDEV.
zh_hans: 打开来自终端的数据库 URL，例如 DDEV 项目的数据库。
zh_hant: 開啟來自終端機的資料庫 URL，例如 DDEV 專案的資料庫。

source: Sorting…
fr: Traitement...

source: Unknown explain variant '%@'. This database offers: %@.
fr: Variante '%@' inconnue expliquée. Cette base de données offre : %@.

source: Granted on %@
fr: Accordé sur %@
ko: %@에 부여됨
tr: %@ üzerinde verildi
vi: Đã cấp trên %@
zh_hans: 已在 %@ 上授予
zh_hant: 已在 %@ 上授予

source: Output format
fr: Format de sortie
ko: 출력 형식
tr: Çıktı biçimi
vi: Định dạng đầu ra
zh_hans: 输出格式
zh_hant: 輸出格式

# Row %d, column %d: %@, %@
source: Row %1$d, column %2$d: %3$@, %4$@
fr: Rang %1$d, colonne %2$d : %3$@, %4$@

source: Select Tab %d
fr: Sélectionner la barre d'onglets %d
ko: 탭 %d 선택
tr: %d. Sekmeyi Seç
vi: Chọn tab %d
zh_hans: 选择标签页 %d
zh_hant: 選擇分頁 %d

source: Leading keyword class
fr: Classe de mots-clés principaux
ko: 선행 키워드 분류
tr: Baştaki anahtar sözcük sınıfı
vi: Lớp từ khoá đứng đầu
zh_hans: 起始关键字类别
zh_hant: 起始關鍵字類別

source: Unknown client
fr: Client inconnu
ko: 알 수 없는 클라이언트
tr: Bilinmeyen istemci
vi: Client không xác định
zh_hans: 未知客户端
zh_hant: 未知用戶端

source: Schema the type lives in
fr: Schéma le type dans lequel il vit

source: All %d rows selected
fr: Toutes les %d lignes sélectionnées
ko: %d개 행 모두 선택됨
tr: Tüm %d satır seçildi
vi: Đã chọn tất cả %d dòng
zh_hans: 已选择全部%d行
zh_hant: 已選取全部 %d 列

source: No Indexes Defined
fr: Aucun index défini
ko: 정의된 인덱스 없음
tr: Tanımlı Dizin Yok
vi: Chưa có chỉ mục
zh_hans: 尚未定义索引
zh_hant: 尚未定義索引

source: keyword: %@
fr: Mot-clé : %@
ko: 키워드: %@
tr: anahtar sözcük: %@
vi: từ khoá: %@
zh_hans: 关键字：%@
zh_hant: 關鍵字:%@

source: The statement to explain, without an EXPLAIN prefix
fr: La déclaration à expliquer, sans préfixe EXPLAIN
ko: EXPLAIN 접두사 없이, 설명할 명령문
tr: EXPLAIN ön eki olmadan, açıklanacak ifade
vi: Câu lệnh cần giải thích, không kèm tiền tố EXPLAIN
zh_hans: 要解释的语句，不带 EXPLAIN 前缀
zh_hant: 要解釋的陳述式，不帶 EXPLAIN 前綴

source: All Rows
fr: Toutes les lignes
ko: 모든 행
tr: Tüm Satırlar
vi: Tất cả dòng
zh_hans: 所有行
zh_hant: 所有列

source: Structure Changes
fr: Changements de structure
ko: 구조 변경 사항
tr: Yapı Değişiklikleri
vi: Thay đổi cấu trúc
zh_hans: 结构更改
zh_hant: 結構變更

source: WITH GRANT OPTION
fr: AVEC OPTION DE BOURSE DE FINANCEMENT

source: The saved tags could not be read. Nothing was changed.
fr: Les balises enregistrées ne pouvaient pas être lues. Rien n'a été modifié.
ko: 저장된 태그를 읽을 수 없습니다. 아무것도 변경되지 않았습니다.
tr: Kayıtlı etiketler okunamadı. Hiçbir şey değiştirilmedi.
vi: Không đọc được các thẻ đã lưu. Không có gì thay đổi.
zh_hans: 无法读取已保存的标签。未做任何更改。
zh_hant: 無法讀取已儲存的標籤。未做任何變更。

source: Try Again
fr: Réessayer
ko: 다시 시도
tr: Tekrar Dene
vi: Thử lại
zh_hans: 重试
zh_hant: 重試

source: Rejected
fr: Réfusé

source: Key columns
fr: Colonnes clés
ko: 키 열
tr: Anahtar sütunlar
vi: Cột khóa
zh_hans: 键列
zh_hant: 鍵欄位

source: The previous response wasn't accepted. Try again.
fr: La réponse précédente n'a pas été acceptée. Réessayez.
ko: 이전 응답이 승인되지 않았습니다. 다시 시도하십시오.
tr: Önceki yanıt kabul edilmedi. Tekrar deneyin.
vi: Câu trả lời trước không được chấp nhận. Hãy thử lại.
zh_hans: 上一次的回答未被接受。请重试。
zh_hant: 上一次的回答未被接受。請再試一次。

# Row %@ of %@
source: Row %1$@ of %2$@
fr: Ligne %1$@ de %2$@

source: This database cannot change an enum's labels
fr: Cette base de données ne peut pas modifier les étiquettes d'un enum.

source: PROCEDURE or FUNCTION
fr: PROCÉDURE ou FONCTION
ko: PROCEDURE 또는 FUNCTION
tr: PROCEDURE veya FUNCTION
vi: PROCEDURE hoặc FUNCTION
zh_hans: PROCEDURE 或 FUNCTION
zh_hant: PROCEDURE 或 FUNCTION

source: Write Concern
fr: Écrire une préoccupation
ko: 쓰기 고려
tr: Yazma Endişesi

source: Your changes will be lost if you don't save them. Tabs whose changes can only be saved from the tab itself stay open.
fr: Vos modifications seront perdues si vous ne les enregistrez pas. Les onglets dont les modifications ne peuvent être enregistrées que depuis l'onglet lui-même restent ouverts.
ko: 저장하지 않으면 변경 사항이 사라집니다. 탭 안에서만 저장할 수 있는 변경 사항이 있는 탭은 열린 채로 남습니다.
tr: Kaydetmezseniz değişiklikleriniz kaybolur. Değişiklikleri yalnızca kendi sekmesinden kaydedilebilen sekmeler açık kalır.
vi: Thay đổi của bạn sẽ mất nếu không lưu. Những tab mà thay đổi chỉ có thể lưu từ chính tab đó sẽ vẫn mở.
zh_hans: 如果不保存，你的更改将会丢失。那些只能在标签页内部保存更改的标签页会保持打开。
zh_hant: 如果不儲存，你的變更將會遺失。那些只能在標籤頁內部儲存變更的標籤頁會保持開啟。

source: Cancel the running query on a server session, or kill the session outright. Takes a process id from get_server_dashboard. Needs tools:write and the user's approval.
fr: Annulez la requête en cours sur une session de serveur, ou terminez la session directement. Prend un identifiant de processus de get_server_dashboard. Nécessite des outils : write et l'approbation de l'utilisateur.
ko: 서버 세션에서 실행 중인 쿼리를 취소하거나 세션 자체를 종료합니다. get_server_dashboard에서 얻은 프로세스 id를 사용합니다. tools:write와 사용자 승인이 필요합니다.
tr: Bir sunucu oturumunda çalışan sorguyu iptal eder veya oturumu tamamen sonlandırır. get_server_dashboard'dan alınan bir işlem kimliği alır. tools:write ve kullanıcının onayı gerekir.
vi: Huỷ truy vấn đang chạy trên một phiên máy chủ, hoặc kết thúc hẳn phiên đó. Nhận process id từ get_server_dashboard. Cần tools:write và sự phê duyệt của người dùng.
zh_hans: 取消服务器会话上正在运行的查询，或者直接终止该会话。需要来自 get_server_dashboard 的进程 id。需要 tools:write 和用户批准。
zh_hant: 取消伺服器工作階段上正在執行的查詢，或者直接終止該工作階段。需要來自 get_server_dashboard 的行程 id。需要 tools:write 和使用者核准。

source: All
fr: Tous
ko: 전체
tr: Tümü
vi: Tất cả
zh_hans: 全部
zh_hant: 全部

source: Purple
fr: Violet
ko: 보라색
tr: Mor
vi: Tím
zh_hans: 紫色
zh_hant: 紫色

source: Compare & Sync Databases…
fr: Comparer et synchroniser les bases de données...
ko: 데이터베이스 비교 및 동기화…
tr: Veritabanlarını Karşılaştır ve Eşitle…
vi: So sánh & Đồng bộ cơ sở dữ liệu…
zh_hans: 比较与同步数据库…
zh_hant: 比較與同步資料庫…

source: SSH command not found. Please ensure OpenSSH is installed.
fr: Commande SSH introuvable. Veuillez vous assurer que OpenSSH est installé.
ko: SSH 명령을 찾을 수 없습니다. OpenSSH가 설치되어 있는지 확인하십시오.
vi: Không tìm thấy lệnh SSH. Vui lòng đảm bảo OpenSSH đã được cài đặt.
zh_hans: 未找到 SSH 命令。请确保已安装 OpenSSH。
zh_hant: 找不到 SSH 指令。請確認已安裝 OpenSSH。

source: Alternate Row
fr: Rang alternatif
ko: 교차 행
tr: Alternatif Satır
vi: Dòng xen kẽ
zh_hans: 交替行
zh_hant: 交替列

source: Sync Error
fr: Erreur de synchronisation
ko: 동기화 오류
tr: Eşitleme Hatası
vi: Lỗi đồng bộ
zh_hans: 同步错误
zh_hant: 同步錯誤

source: No queries ran in this range, from the sources you selected.
fr: Aucune requête n'a été exécutée dans cette plage, à partir des sources que vous avez sélectionnées.
ko: 선택한 소스에서 이 범위에 실행된 쿼리가 없습니다.
tr: Seçtiğiniz kaynaklardan bu aralıkta hiçbir sorgu çalışmadı.
vi: Không có truy vấn nào chạy trong khoảng này, từ các nguồn bạn đã chọn.
zh_hans: 在你选择的来源中，此范围内没有查询运行。
zh_hant: 在你選擇的來源中，此範圍內沒有查詢執行。

source: Only UTF-8 JSON files can be opened.
fr: Seuls les fichiers JSON UTF-8 peuvent être ouverts.

source: Markdown tables. Paste into a README, an issue or a wiki.
fr: Tables Markdown. Coller dans un README, un problème ou un wiki.

source: Read From
fr: Lire de

source: Single-clicking a table opens a temporary tab that gets replaced on next click.
fr: En cliquant une seule fois sur une table, une onglet temporaire s'ouvre qui est remplacé lors du prochain clic.
ko: 테이블을 한 번 클릭하면 임시 탭에서 열리며, 다음 테이블을 클릭하면 대체됩니다.
tr: Bir tabloya tek tıklamak, sonraki tıklamada yerini bırakan geçici bir sekme açar.
vi: Nhấp một lần vào bảng sẽ mở tab tạm thời, tab này sẽ được thay thế khi nhấp tiếp.
zh_hans: 单击表时打开临时标签页，下次点击时会被替换。
zh_hant: 按一下資料表會開啟暫時分頁，下次按一下時會被取代。

source: The source and the target share no writable column.
fr: La source et la cible n'ont pas de colonne écrivable en commun.

source: Inspector Options
fr: Options de l'inspecteur

source: TablePro did not open that table in time.
fr: TablePro n'a pas ouvert cette table à temps.
ko: TablePro가 제한 시간 안에 해당 테이블을 열지 못했습니다.
tr: TablePro, o tabloyu zamanında açmadı.
vi: TablePro đã không mở kịp bảng đó.
zh_hans: TablePro 没有及时打开那张表。
zh_hant: TablePro 沒有及時開啟那張資料表。

source: Restored the mapping saved for %@.
fr: La cartographie enregistrée pour %@ a été restaurée.

source: Its key includes %@, an expression in the source engine's SQL.
fr: Sa clé comprend %@, une expression dans le SQL du moteur de source.

source: License public key not found in app bundle.
fr: La clé publique de licence n'a pas été trouvée dans le paquet d'applications.
ko: 앱 번들에서 라이선스 공개 키를 찾을 수 없습니다.
tr: Uygulama paketinde lisans açık anahtarı bulunamadı.
vi: Không tìm thấy khoá công khai giấy phép trong gói ứng dụng.
zh_hans: 应用包中未找到许可证公钥。
zh_hant: 在應用程式套件中找不到授權公開金鑰。

source: Leave the comment empty to remove it.
fr: Laissez le commentaire vide pour le supprimer.

source: The batch is committing and cannot be stopped.
fr: Le lot est en train de se commettre et ne peut pas être arrêté.

source: Starts and stops `cloudflared access tcp` with this connection and routes it through a local port.
fr: Démarre et arrête l'accès TCP cloudflared avec cette connexion et le route par un port local.
ko: 이 연결과 함께 `cloudflared access tcp`를 시작 및 중지하고 로컬 포트를 통해 라우팅합니다.
tr: `cloudflared access tcp` komutunu bu bağlantıyla birlikte başlatıp durdurur ve bağlantıyı yerel bir port üzerinden yönlendirir.
vi: Khởi động và dừng `cloudflared access tcp` cùng kết nối này và định tuyến qua một cổng cục bộ.
zh_hans: 随此连接启动和停止 `cloudflared access tcp`，并通过本地端口路由。
zh_hant: 隨此連線啟動和停止 `cloudflared access tcp`，並透過本機連接埠路由。

source: Apply this rule
fr: Appliquez cette règle

source: Yellow
fr: Jaune
ko: 노란색
tr: Sarı
vi: Vàng
zh_hans: 黄色
zh_hant: 黃色

source: Preview SQL
fr: Aperçu SQL
ko: SQL 미리보기
tr: SQL Önizleme
vi: Xem trước SQL
zh_hans: 预览 SQL
zh_hant: 預覽 SQL

source: Column Details
fr: Détails de la colonne
ko: 열 세부사항
tr: Sütun Ayrıntıları
vi: Chi tiết cột
zh_hans: 列详情
zh_hant: 欄位詳細資料

source: Clear All
fr: Effacer tout
ko: 모두 지우기
tr: Tümünü Temizle
vi: Xóa tất cả
zh_hans: 全部清除
zh_hant: 全部清除

source: Close Schema “%@”
fr: Fermer le schéma "%@"
ko: 스키마 “%@” 닫기
tr: “%@” Şemasını Kapat
vi: Đóng schema “%@”
zh_hans: 关闭 Schema“%@”
zh_hant: 關閉綱要「%@」

source: Could not parse database URL: %@
fr: Impossible de parser l'URL de la base de données : %@
ko: 데이터베이스 URL을 구문 분석할 수 없습니다: %@
tr: Veritabanı URL'si ayrıştırılamadı: %@
vi: Không thể phân tích URL cơ sở dữ liệu: %@
zh_hans: 无法解析数据库 URL：%@
zh_hant: 無法解析資料庫 URL：%@

source: Every result set a script returned, in order, when it returned more than one
fr: Chaque ensemble de résultats renvoie un script, dans l'ordre, lorsqu'il renvoie plus d'un.

source: The SSH server could not reach %1$@. That address is resolved from the SSH server, not from your Mac, so a database that only listens on 127.0.0.1 needs Host set to localhost. Also check that sshd allows TCP forwarding (AllowTcpForwarding). (%2$@)
fr: Le serveur SSH n'a pas pu atteindre %1$@. Cette adresse est résolue par le serveur SSH, et non par votre Mac, donc une base de données qui ne s'écoute que sur 127.0.0.1 nécessite que l'hôte soit défini sur localhost. Vérifiez également que sshd autorise le redirection TCP (AllowTcpForwarding). (%2$@)
ko: SSH 서버에서 %1$@에 연결할 수 없습니다. 이 주소는 Mac이 아니라 SSH 서버에서 확인되므로, 127.0.0.1에서만 수신하는 데이터베이스의 호스트는 localhost로 설정해야 합니다. sshd에서 TCP 전달(AllowTcpForwarding)을 허용하는지도 확인하십시오. (%2$@)
tr: SSH sunucusu %1$@ adresine ulaşamadı. Bu adres sizin Mac'inizden değil, SSH sunucusundan çözümlenir; bu yüzden yalnızca 127.0.0.1 dinleyen bir veritabanı için Sunucu alanı localhost olmalıdır. Ayrıca sshd'nin TCP yönlendirmeye izin verdiğini denetleyin (AllowTcpForwarding). (%2$@)
vi: Máy chủ SSH không thể kết nối tới %1$@. Địa chỉ đó được phân giải từ máy chủ SSH chứ không phải từ máy Mac của bạn, nên cơ sở dữ liệu chỉ lắng nghe trên 127.0.0.1 cần đặt Máy chủ là localhost. Ngoài ra hãy kiểm tra sshd có cho phép chuyển tiếp TCP không (AllowTcpForwarding). (%2$@)
zh_hans: SSH 服务器无法访问 %1$@。该地址是从 SSH 服务器解析的，而不是从你的 Mac 解析，因此只监听 127.0.0.1 的数据库需要把主机设为 localhost。另请检查 sshd 是否允许 TCP 转发（AllowTcpForwarding）。(%2$@)
zh_hant: SSH 伺服器無法連到 %1$@。該位址是從 SSH 伺服器解析的，而不是從你的 Mac 解析，因此只監聽 127.0.0.1 的資料庫需要將主機設為 localhost。另請檢查 sshd 是否允許 TCP 轉送（AllowTcpForwarding）。(%2$@)

source: Change Password for %@
fr: Changer le mot de passe pour %@
ko: %@ 암호 변경
tr: %@ İçin Parolayı Değiştir
vi: Đổi mật khẩu cho %@
zh_hans: 更改 %@ 的密码
zh_hant: 更改 %@ 的密碼

source: Show Welcome Window
fr: Afficher la fenêtre de bienvenue
ko: 시작 윈도우 보기
tr: Karşılama Penceresini Göster
vi: Hiện cửa sổ chào mừng
zh_hans: 显示欢迎窗口
zh_hant: 顯示歡迎視窗

source: Enter an absolute path, as it appears on the SSH server.
fr: Entrez un chemin absolu, tel qu'il apparaît sur le serveur SSH.
ko: SSH 서버에 표시되는 절대 경로를 입력하십시오.
tr: SSH sunucusunda göründüğü şekliyle mutlak bir yol girin.
vi: Nhập đường dẫn tuyệt đối, đúng như trên máy chủ SSH.
zh_hans: 请输入绝对路径，与 SSH 服务器上的路径一致。
zh_hant: 請輸入絕對路徑，與 SSH 伺服器上的路徑一致。

source: No Version Selected
fr: Aucune version sélectionnée

source: Y Axis
fr: Équateur Y
ko: Y축
tr: Y Ekseni
vi: Trục Y
zh_hans: Y 轴
zh_hant: Y 軸

source: Table Favorites:
fr: Favoris de table :
ko: 테이블 즐겨찾기:
tr: Tablo Sık Kullanılanları:
vi: Bảng yêu thích:
zh_hans: 表收藏：
zh_hant: 資料表我的最愛：

source: Tables, columns, indexes, and foreign keys for a connected database
fr: Tables, colonnes, index et clés étrangères pour une base de données connectée.
ko: 연결된 데이터베이스의 테이블, 열, 인덱스 및 외래 키
tr: Bağlı bir veritabanının tabloları, sütunları, indeksleri ve yabancı anahtarları
vi: Bảng, cột, index và khóa ngoại của một cơ sở dữ liệu đã kết nối
zh_hans: 某个已连接数据库的表、列、索引和外键
zh_hant: 某個已連線資料庫的資料表、欄位、索引和外鍵

source: "%@" will be removed from the sidebar. Files on disk will not be deleted.
fr: «%@» sera supprimé de la barre latérale. Les fichiers sur le disque ne seront pas supprimés.
ko: "%@" 항목이 사이드바에서 제거됩니다. 디스크의 파일은 삭제되지 않습니다.
tr: "%@" Sidebar'dan kaldırılacak. Diskteki dosyalar silinmeyecek.
vi: "%@" sẽ bị gỡ khỏi thanh bên. Các tệp trên đĩa sẽ không bị xóa.
zh_hans: "%@"将从侧边栏中移除。磁盘上的文件不会被删除。
zh_hant: 「%@」將從側邊欄移除。磁碟上的檔案不會被刪除。

source: Sessions the server reports
fr: Sessions que le serveur signale
ko: 서버가 보고한 세션
tr: Sunucunun bildirdiği oturumlar
vi: Các phiên mà máy chủ báo cáo
zh_hans: 服务器报告的会话
zh_hant: 伺服器回報的工作階段

source: Use Default
fr: Utiliser par défaut
ko: 기본값 사용
tr: Varsayılanı Kullan
vi: Mặc định
zh_hans: 使用默认
zh_hant: 使用預設

source: Include every table in this group
fr: Incluez toutes les tables de ce groupe
ko: 이 그룹의 모든 테이블 포함
tr: Bu gruptaki her tabloyu dahil et
vi: Bao gồm mọi bảng trong nhóm này
zh_hans: 包含此分组中的所有表
zh_hant: 納入此分組中的所有資料表

source: Executing…
fr: Exécution en cours...
ko: 실행 중…
tr: Çalıştırılıyor…
vi: Đang thực thi…
zh_hans: 正在执行…
zh_hant: 正在執行…

source: The server sent an unexpected message and the connection was reset. Run the query again.
fr: Le serveur a envoyé un message inattendu et la connexion a été réinitialisée. Réexécutez la requête.
ko: 서버에서 예상하지 못한 메시지를 보내 연결을 재설정했습니다. 쿼리를 다시 실행하십시오.
tr: Sunucu beklenmeyen bir mesaj gönderdi ve bağlantı sıfırlandı. Sorguyu yeniden çalıştırın.
vi: Máy chủ đã gửi một thông điệp không mong đợi và kết nối đã bị đặt lại. Hãy chạy lại truy vấn.
zh_hans: 服务器发送了意外消息，连接已重置。请重新运行该查询。
zh_hant: 伺服器傳送了非預期的訊息，連線已重設。請重新執行該查詢。

source: Hosts
fr: Hôtes
ko: 호스트
tr: Sunucular
vi: Host
zh_hans: 主机
zh_hant: 主機

source: Pass either 'query' or 'tables'.
fr: Fournissez soit 'query' soit 'tables'.
ko: 'query' 또는 'tables' 중 하나를 전달하십시오.
tr: 'query' ya da 'tables' geçirin.
vi: Hãy truyền 'query' hoặc 'tables'.
zh_hans: 请传入 'query' 或 'tables'。
zh_hant: 請傳入 'query' 或 'tables'。

source: Plugin Not Installed
fr: Plugin non installé
ko: 플러그인이 설치되지 않음
tr: Eklenti Kurulu Değil
vi: Plugin chưa được cài đặt
zh_hans: 插件未安装
zh_hant: 外掛未安裝

source: Insert rows into a table using bound parameters, so values are never spliced into SQL text. Needs tools:write and goes through the connection's Safe Mode approval.
fr: Insérez des lignes dans une table en utilisant des paramètres liés, de sorte que les valeurs ne soient jamais insérées dans le texte SQL. Nécessite des outils : écriture et passe par l'approbation du mode sûr de la connexion.
ko: 바인딩된 매개변수로 테이블에 행을 삽입하므로 값이 SQL 텍스트에 직접 끼워 넣어지지 않습니다. tools:write가 필요하며 연결의 안전 모드 승인을 거칩니다.
tr: Bağlı parametreler kullanarak bir tabloya satır ekler, böylece değerler SQL metnine hiçbir zaman eklenmez. tools:write gerektirir ve bağlantının Güvenli Mod onayından geçer.
vi: Chèn các dòng vào bảng bằng tham số ràng buộc, nên giá trị không bao giờ bị ghép thẳng vào chuỗi SQL. Cần tools:write và phải qua phê duyệt Chế độ an toàn của kết nối.
zh_hans: 使用绑定参数向表中插入行，因此值绝不会被拼接进 SQL 文本。需要 tools:write，并且要经过该连接的安全模式批准。
zh_hant: 使用繫結參數向資料表中插入列，因此值絕不會被拼接進 SQL 文字。需要 tools:write，並且要經過該連線的安全模式核准。

source: SSH authentication cancelled.
fr: L'authentification SSH a été annulée.
ko: SSH 인증이 취소되었습니다.
tr: SSH kimlik doğrulaması iptal edildi.
vi: Đã hủy xác thực SSH.
zh_hans: SSH 认证已取消。
zh_hant: SSH 驗證已取消。

source: Focus Inspector
fr: Inspectionnaire de la concentration

source: Edit Connection…
fr: Modifier la connexion...

source: Distributed SQL, MySQL-compatible
fr: SQL distribué, compatible avec MySQL
ko: MySQL 호환 분산 SQL
tr: Dağıtık SQL, MySQL uyumlu
vi: SQL phân tán, tương thích MySQL
zh_hans: 分布式 SQL，兼容 MySQL
zh_hant: 分散式 SQL，相容 MySQL

source: Could not install the sample database: %@
fr: Impossible d'installer la base de données d'exemple : %@
ko: 샘플 데이터베이스를 설치할 수 없습니다: %@
tr: Örnek veritabanı yüklenemedi: %@
vi: Không thể cài đặt cơ sở dữ liệu mẫu: %@
zh_hans: 无法安装示例数据库：%@
zh_hant: 無法安裝範例資料庫：%@

source: No duplicate rows found.
fr: Aucune ligne de doublon n'a été trouvée.

source: %@ (reader)
fr: %@ (lecteur)

source: Query Behavior
fr: Comportement de la requête
ko: 쿼리 동작
tr: Sorgu Davranışı
vi: Hành vi truy vấn
zh_hans: 查询行为
zh_hant: 查詢行為

source: General
fr: Général
ko: 일반
tr: Genel
vi: Tổng quát
zh_hans: 通用
zh_hant: 一般

source: %d rows will be restored
fr: %d lignes seront restaurées
ko: %d개 행이 복원됩니다
tr: %d satır geri yüklenecek
vi: %d dòng sẽ được khôi phục
zh_hans: 将恢复 %d 行
zh_hant: 將還原 %d 列

source: Are you sure you want to cancel the running query for this session?
fr: Êtes-vous sûr de vouloir annuler la requête en cours pour cette session ?
ko: 이 세션에서 실행 중인 쿼리를 취소하시겠습니까?
tr: Bu oturumun çalışan sorgusunu iptal etmek istediğinizden emin misiniz?
vi: Bạn có chắc muốn huỷ truy vấn đang chạy cho phiên này?
zh_hans: 确定要取消此会话正在运行的查询吗？
zh_hant: 確定要取消此工作階段正在執行的查詢嗎？

source: Don't Allow
fr: Ne permettez pas
ko: 허용 안 함
tr: İzin Verme
vi: Không cho phép
zh_hans: 不允许
zh_hant: 不允許

source: Plain-text accounting ledgers
fr: Livrets de comptes en texte brut
ko: 일반 텍스트 회계 원장
tr: Düz metin muhasebe defterleri
vi: Sổ kế toán dạng văn bản thuần
zh_hans: 纯文本记账账本
zh_hant: 純文字記帳帳本

source: List Tables
fr: Liste des tableaux
ko: 테이블 목록
tr: Tabloları Listele
vi: Liệt kê bảng
zh_hans: 列出表
zh_hant: 列出資料表

source: Toggle Comment
fr: Activer/désactiver le commentaire
ko: 주석 전환
tr: Yorumu Aç/Kapat
vi: Bật/tắt comment
zh_hans: 切换注释
zh_hant: 切換註解

source: Read-Only Connection
fr: Connexion en lecture seule
ko: 읽기 전용 연결
tr: Salt Okunur Bağlantı
vi: Kết nối chỉ đọc
zh_hans: 只读连接
zh_hant: 唯讀連線

source: Passwords stay in your Keychain. Tunnel through SSH or connect over SSL/TLS.
fr: Les mots de passe restent dans votre portefeuille de clés. Tunnelisez via SSH ou connectez-vous via SSL/TLS.
ko: 암호는 키체인에 보관됩니다. SSH 터널이나 SSL/TLS로 연결하세요.
tr: Parolalar Anahtar Zinciri'nizde kalır. SSH tüneli üzerinden ya da SSL/TLS ile bağlanın.
vi: Mật khẩu được giữ trong Chuỗi khóa. Kết nối qua đường hầm SSH hoặc SSL/TLS.
zh_hans: 密码保存在你的钥匙串中。可通过 SSH 隧道或 SSL/TLS 连接。
zh_hant: 密碼保存在你的鑰匙圈中。可透過 SSH 通道或 SSL/TLS 連線。

source: Uncommitted changes
fr: Changements non engagés

source: This driver is already connecting or connected.
fr: Ce pilote se connecte déjà ou est déjà connecté.

source: Avg Row
fr: Rang moyen
ko: 평균 행
tr: Ort. Satır
vi: TB dòng
zh_hans: 平均行
zh_hant: 平均列

source: Semicolon
fr: Point-virgule

source: Enter database name
fr: Entrez le nom de la base de données
ko: 데이터베이스 이름 입력
tr: Veritabanı adı girin
vi: Nhập tên cơ sở dữ liệu
zh_hans: 输入数据库名称
zh_hant: 輸入資料庫名稱

source: The target could not be read with its filter: %@
fr: La cible ne pouvait pas être lu avec son filtre : %@

source: ran %@×
fr: A couru %@×
ko: 실행 %@회
tr: %@ kez çalıştı
vi: chạy %@ lần
zh_hans: 运行 %@ 次
zh_hant: 執行 %@ 次

source: Restore Dump…
fr: Restaurer le déversement...
ko: 덤프 복원…
tr: Dökümü Geri Yükle…
vi: Khôi phục dump…
zh_hans: 恢复转储…
zh_hant: 正在還原備份…

source: Compare the two databases
fr: Comparer les deux bases de données
ko: 두 데이터베이스 비교
tr: İki veritabanını karşılaştır
vi: So sánh hai cơ sở dữ liệu
zh_hans: 比较这两个数据库
zh_hant: 比較這兩個資料庫

source: Matching tables first, then matching columns
fr: Correspondance des tableaux d'abord, puis des colonnes.
ko: 일치하는 테이블을 먼저, 그다음 일치하는 열
tr: Önce eşleşen tablolar, sonra eşleşen sütunlar
vi: Bảng khớp trước, rồi tới cột khớp
zh_hans: 先是匹配的表，然后是匹配的列
zh_hant: 先是符合的資料表，然後是符合的欄位

source: Log MCP queries in history
fr: Journaliser les requêtes MCP dans l'historique
ko: 기록에 MCP 쿼리 로그 남기기
tr: MCP sorgularını geçmişe kaydet
vi: Ghi truy vấn MCP vào lịch sử
zh_hans: 在历史记录中记录 MCP 查询
zh_hant: 在歷史紀錄中記錄 MCP 查詢

source: Duplicate Line
fr: Ligne de duplication
ko: 줄 복제
tr: Satırı Çoğalt
vi: Nhân bản dòng
zh_hans: 复制行
zh_hant: 複製一行

source: New query tab
fr: Nouvelle onglet de requête
ko: 새 쿼리 탭
tr: Yeni sorgu sekmesi
vi: Tab truy vấn mới
zh_hans: 新建查询标签页
zh_hant: 新增查詢分頁

source: AWS SSO sign-in finished. Test the connection again.
fr: La connexion SSO AWS est terminée. Veuillez réessayer la connexion.
ko: AWS SSO 로그인이 완료되었습니다. 연결을 다시 테스트하십시오.
tr: AWS SSO oturum açma tamamlandı. Bağlantıyı yeniden test edin.
vi: Đã hoàn tất đăng nhập AWS SSO. Hãy kiểm tra lại kết nối.
zh_hans: AWS SSO登录已完成。请再次测试连接。
zh_hant: AWS SSO 登入已完成。請再次測試連線。

source: Unsupported encryption version %d
fr: Version d'encodage non prise en charge %d
ko: 지원되지 않는 암호화 버전 %d
tr: Desteklenmeyen şifreleme sürümü %d
vi: Phiên bản mã hoá %d không được hỗ trợ
zh_hans: 不支持的加密版本%d
zh_hant: 不支援的加密版本 %d

source: Export Tables…
fr: Exporter des tableaux...
ko: 테이블 내보내기…
tr: Tabloları Dışa Aktar…
vi: Xuất bảng…
zh_hans: 导出表…
zh_hant: 匯出資料表…

source: Move to
fr: Mouvement vers
ko: 다음으로 이동
tr: Taşı
vi: Di chuyển đến
zh_hans: 移动到
zh_hant: 移動至

source: Showing first %lld keys
fr: Affichage des premières %lld clés
ko: 처음 %lld개 키 표시
tr: İlk %lld anahtar gösteriliyor
vi: Hiển thị %lld khóa đầu tiên
zh_hans: 显示前 %lld 个键
zh_hant: 顯示前 %lld 個鍵

source: Match Case
fr: Correspondance de casse
ko: 대/소문자 구분
tr: Büyük/Küçük Harf Eşleştir
vi: Phân biệt hoa thường
zh_hans: 区分大小写
zh_hant: 區分大小寫
